# ViewerBoundActiveNear Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewerBoundActiveNear Property
ParameterTypeId Class See Also
---
"Near Clip Active"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewerBoundActiveNear { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewerBoundActiveNear As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewerBoundActiveNear {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace